app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @result = []
    @posts.each do |post|
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params, user_id: User.last.id)

    if @post.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 31], ["created_at", "2020-11-27 12:05:23.633239"], ["updated_at", "2020-11-27 12:05:23.633239"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "edited5"], ["updated_at", "2020-11-27 11:51:44.420471"], ["id", 51]]